Revit 2024 API
LabelUtils.GetLabelFor Method (BuiltInCategory)
 Gets the user-visible name for a BuiltInCategory.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public static string GetLabelFor(
	BuiltInCategory builtInCategory
)
Visual Basic
Public Shared Function GetLabelFor ( _
	builtInCategory As BuiltInCategory _
) As String
Visual C++
public:
static String^ GetLabelFor(
	BuiltInCategory builtInCategory
)
Parameters
builtInCategory
Type: Autodesk.Revit.DB.BuiltInCategory
 The BuiltInCategory to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the builtin category is not valid.
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace